app/controllers/bookers_controller.rb

  def index
   	@post = Booker.page(params[:page]).reverse_order
    @newpost = Booker.new
    @user = User.all
---
SELECT  "bookers".* FROM "bookers" ORDER BY "bookers"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "bookers"
SELECT "users".* FROM "users"

  def show
    @newpost = Booker.new
  	@post = Booker.find(params[:id])
---
SELECT  "bookers".* FROM "bookers" WHERE "bookers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @post = Booker.page(params[:page]).reverse_order
  	@newpost = Booker.new(post_params)
    @newpost.user_id = current_user.id
    if @newpost.save
---
SELECT  "bookers".* FROM "bookers" ORDER BY "bookers"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "bookers"
INSERT INTO "bookers" ("title", "impression", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "f"], ["impression", "f"], ["user_id", 1], ["created_at", "2018-02-13 10:36:59.762829"], ["updated_at", "2018-02-13 10:36:59.762829"]]

  def edit
  	@post = Booker.find(params[:id])
---
SELECT  "bookers".* FROM "bookers" WHERE "bookers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
  	post = Booker.find(params[:id])
  	post.update(post_params)
---
SELECT  "bookers".* FROM "bookers" WHERE "bookers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "bookers" SET "title" = ?, "impression" = ?, "name" = ?, "updated_at" = ? WHERE "bookers"."id" = ?  [["title", "a"], ["impression", "a"], ["name", "a"], ["updated_at", "2018-02-10 10:07:52.931174"], ["id", 1]]

  def destroy
  	post = Booker.find(params[:id])
  	post.destroy
---
SELECT  "bookers".* FROM "bookers" WHERE "bookers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "bookers" WHERE "bookers"."id" = ?  [["id", 5]]