app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def user
    @user = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "bookers".* FROM "bookers" WHERE "bookers"."user_id" = ? ORDER BY "bookers"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 15], ["OFFSET", 0]]
SELECT COUNT(*) FROM "bookers" WHERE "bookers"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @post = @user.bookers.page(params[:page]).reverse_order

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
  	@user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "profile_text" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "mummy_d"], ["profile_image_id", "1a68f220cb298400f228abc1c3b542dbc5785d2d688e9a95a4474974cb21"], ["profile_text", "酔っ払いのライマー"], ["updated_at", "2018-02-16 09:46:07.145469"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)